Feature: Звільнення співробітника

  Scenario: Успішне звільнення співробітника
    Given існує співробітник з ID 102
    When я викликаю функцію dismiss() для співробітника з ID 102
    Then система повертає результат "true" і співробітник звільнений

  Scenario: Невдале звільнення через відсутність співробітника
    Given не існує співробітника з ID 999
    When я викликаю функцію dismiss() для співробітника з ID 999
    Then система повертає результат "false" та виводить повідомлення про помилку
